In [2]:
import pandas as pd

In [4]:
dogs = pd.read_csv("Datasets/dogs.csv")

In [6]:
dogs.head()

      name      breed  color  height_cm  weight_kg0
0    Bella   Labrador  Brown         56         251
1  Charlie     Poodle  Black         43         232
2     Lucy       Chow  Brown         46         223
3   Cooper  Schnauzer   Gray         49         174
4      Max   Labrador  Black         59         295

In [8]:
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   name        7 non-null      object
 1   breed       7 non-null      object
 2   color       7 non-null      object
 3   height_cm   7 non-null      int64
 4   weight_kg0  7 non-null      int64
dtypes: int64(2), object(3)
memory usage: 412.0+ bytes

In [10]:
dogs.describe()

       height_cm  weight_kg0
count   7.000000    7.000000
mean   49.714286  182.142857
std    17.960274   98.128196
min    18.000000   26.000000
25%    44.500000  124.000000
50%    49.000000  223.000000
75%    57.500000  241.500000
max    77.000000  295.000000

In [12]:
dogs.values

array([['Bella', 'Labrador', 'Brown', 56, 251],
       ['Charlie', 'Poodle', 'Black', 43, 232],
       ['Lucy', 'Chow', 'Brown', 46, 223],
       ['Cooper', 'Schnauzer', 'Gray', 49, 174],
       ['Max', 'Labrador', 'Black', 59, 295],
       ['Stella', 'Chihuahua', 'Tan', 18, 26],
       ['Bernie', 'St. Bernard', 'White', 77, 74]], dtype=object)

In [14]:
dogs.columns

Index(['name', 'breed', 'color', 'height_cm', 'weight_kg0'], dtype='object')

In [16]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

In [18]:
dogs.sort_values(by="height_cm",ascending=False)

      name        breed  color  height_cm  weight_kg0
6   Bernie  St. Bernard  White         77          74
4      Max     Labrador  Black         59         295
0    Bella     Labrador  Brown         56         251
3   Cooper    Schnauzer   Gray         49         174
2     Lucy         Chow  Brown         46         223
1  Charlie       Poodle  Black         43         232
5   Stella    Chihuahua    Tan         18          26

In [22]:
dogs.sort_values(by=["height_cm", "weight_kg0"],ascending=[False, True])

      name        breed  color  height_cm  weight_kg0
6   Bernie  St. Bernard  White         77          74
4      Max     Labrador  Black         59         295
0    Bella     Labrador  Brown         56         251
3   Cooper    Schnauzer   Gray         49         174
2     Lucy         Chow  Brown         46         223
1  Charlie       Poodle  Black         43         232
5   Stella    Chihuahua    Tan         18          26

In [24]:
dogs[["name","breed"]]

      name        breed
0    Bella     Labrador
1  Charlie       Poodle
2     Lucy         Chow
3   Cooper    Schnauzer
4      Max     Labrador
5   Stella    Chihuahua
6   Bernie  St. Bernard

In [28]:
dogs[dogs["height_cm"] > 70]

     name        breed  color  height_cm  weight_kg0
6  Bernie  St. Bernard  White         77          74

In [32]:
columns_to_select = ["name","height_cm"]
dogs[columns_to_select]

      name  height_cm
0    Bella         56
1  Charlie         43
2     Lucy         46
3   Cooper         49
4      Max         59
5   Stella         18
6   Bernie         77

In [34]:
conditon1 = dogs["breed"] == "Labrador"
conditon2 = dogs["height_cm"] > 50

dogs[conditon1 & conditon2]

    name     breed  color  height_cm  weight_kg0
0  Bella  Labrador  Brown         56         251
4    Max  Labrador  Black         59         295

In [38]:
conditon3 = ["Black", "Brown"]
dogs[dogs["color"].isin(conditon3)]

      name     breed  color  height_cm  weight_kg0
0    Bella  Labrador  Brown         56         251
1  Charlie    Poodle  Black         43         232
2     Lucy      Chow  Brown         46         223
4      Max  Labrador  Black         59         295

In [42]:
dogs["bmi"] = dogs["weight_kg0"]/(dogs["height_cm"]**2)

dogs

      name        breed  color  height_cm  weight_kg0       bmi
0    Bella     Labrador  Brown         56         251  0.080038
1  Charlie       Poodle  Black         43         232  0.125473
2     Lucy         Chow  Brown         46         223  0.105388
3   Cooper    Schnauzer   Gray         49         174  0.072470
4      Max     Labrador  Black         59         295  0.084746
5   Stella    Chihuahua    Tan         18          26  0.080247
6   Bernie  St. Bernard  White         77          74  0.012481

In [54]:
dogs_gt_50 = dogs[dogs["height_cm"] > 50]
dogs_sorted = dogs_gt_50.sort_values(by="height_cm", ascending=False)

dogs_sorted[["name","height_cm","bmi"]]

     name  height_cm       bmi
6  Bernie         77  0.012481
4     Max         59  0.084746
0   Bella         56  0.080038